hamza-kaka/PE_McuPinConfig/PE_McuConfig.ioc
PG12.GPIOParameters=PinAttribute
PG12.Mode=RGB888
PG12.PinAttribute=CortexM7
PG12.Signal=LTDC_B1
PG13.GPIOParameters=PinAttribute
PG13.Mode=RMII
PG13.PinAttribute=CortexM7
PG13.Signal=ETH_TXD0
PG14.GPIOParameters=PinAttribute
PG14.Locked=true
PG14.Mode=RMII
PG14.PinAttribute=CortexM7
PG14.Signal=ETH_TXD1
PG15.GPIOParameters=PinAttribute
PG15.Locked=true
PG15.PinAttribute=Free
PG15.Signal=GPIO_Input
PG2.GPIOParameters=GPIO_Label,PinAttribute
PG2.GPIO_Label=touch_int
PG2.Locked=true
PG2.PinAttribute=Free
PG2.Signal=GPIO_Input
PG3.GPIOParameters=GPIO_Label,PinAttribute
PG3.GPIO_Label=touch_rst
PG3.Locked=true
PG3.PinAttribute=Free
PG3.Signal=GPIO_Output
PG4.GPIOParameters=PinAttribute
PG4.Locked=true
PG4.PinAttribute=Free
PG4.Signal=GPIO_Input
PG5.GPIOParameters=PinAttribute
PG5.Locked=true
PG5.PinAttribute=Free
PG5.Signal=GPIO_Input
PG6.GPIOParameters=PinAttribute
PG6.Mode=Output_TE1TE2
PG6.PinAttribute=CortexM7
PG6.Signal=HRTIM_CHE1
PG7.GPIOParameters=PinAttribute
PG7.Mode=Output_TE1TE2
PG7.PinAttribute=CortexM7
PG7.Signal=HRTIM_CHE2
PG8.GPIOParameters=PinAttribute
PG8.Locked=true
PG8.PinAttribute=Free
PG8.Signal=GPIO_Input
PG9.GPIOParameters=PinAttribute
PG9.Locked=true
PG9.PinAttribute=Free
PG9.Signal=GPIO_Input
PH0-OSC_IN\ (PH0).GPIOParameters=PinAttribute
PH0-OSC_IN\ (PH0).Locked=true
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN\ (PH0).PinAttribute=CortexM7
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT\ (PH1).GPIOParameters=PinAttribute
PH1-OSC_OUT\ (PH1).Locked=true
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT\ (PH1).PinAttribute=CortexM7
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PH10.GPIOParameters=PinAttribute
PH10.Mode=RGB888
PH10.PinAttribute=CortexM7
PH10.Signal=LTDC_R4
PH11.GPIOParameters=PinAttribute
PH11.Mode=RGB888
PH11.PinAttribute=CortexM7
PH11.Signal=LTDC_R5
PH12.GPIOParameters=PinAttribute
PH12.Mode=RGB888
PH12.PinAttribute=CortexM7
PH12.Signal=LTDC_R6
PH13.GPIOParameters=PinAttribute
PH13.Mode=PWM Generation1 CH1 CH1N
PH13.PinAttribute=CortexM7
PH13.Signal=TIM8_CH1N
PH14.GPIOParameters=PinAttribute
PH14.Mode=RGB888
PH14.PinAttribute=CortexM7
PH14.Signal=LTDC_G3
PH15.GPIOParameters=PinAttribute
PH15.Mode=RGB888
PH15.PinAttribute=CortexM7
PH15.Signal=LTDC_G4
PH2.GPIOParameters=PinAttribute
PH2.Locked=true
PH2.Mode=RGB888
PH2.PinAttribute=CortexM7
PH2.Signal=LTDC_R0
PH3.GPIOParameters=PinAttribute
PH3.Mode=RGB888
PH3.PinAttribute=CortexM7
PH3.Signal=LTDC_R1
PH4.GPIOParameters=PinAttribute
PH4.Mode=I2C
PH4.PinAttribute=CortexM7
PH4.Signal=I2C2_SCL
PH5.GPIOParameters=PinAttribute
PH5.Mode=I2C
PH5.PinAttribute=CortexM7
PH5.Signal=I2C2_SDA
PH6.GPIOParameters=PinAttribute
PH6.PinAttribute=CortexM7
PH6.Signal=S_TIM12_CH1
PH7.GPIOParameters=PinAttribute
PH7.Mode=SMBus-two-wire-Interface
PH7.PinAttribute=CortexM7
PH7.Signal=I2C3_SCL
PH8.GPIOParameters=PinAttribute
PH8.Mode=RGB888
PH8.PinAttribute=CortexM7
PH8.Signal=LTDC_R2
PH9.GPIOParameters=PinAttribute
PH9.Mode=RGB888
PH9.PinAttribute=CortexM7
PH9.Signal=LTDC_R3
PI0.GPIOParameters=PinAttribute
PI0.Mode=RGB888
PI0.PinAttribute=CortexM7
PI0.Signal=LTDC_G5
PI1.GPIOParameters=PinAttribute
PI1.Locked=true
PI1.PinAttribute=Free
PI1.Signal=GPIO_Input
PI10.GPIOParameters=PinAttribute
PI10.Mode=RGB888
PI10.PinAttribute=CortexM7
PI10.Signal=LTDC_HSYNC
PI11.GPIOParameters=PinAttribute
PI11.Mode=RGB888
PI11.PinAttribute=CortexM7
PI11.Signal=LTDC_G6
PI15.GPIOParameters=PinAttribute
PI15.Mode=RGB888
PI15.PinAttribute=CortexM7
PI15.Signal=LTDC_G2
PI2.GPIOParameters=GPIO_Label,PinAttribute
PI2.GPIO_Label=LCD_Disp
PI2.Locked=true
PI2.PinAttribute=Free
PI2.Signal=GPIO_Output
PI3.GPIOParameters=PinAttribute
PI3.Locked=true
PI3.PinAttribute=Free
PI3.Signal=GPIO_Input
PI4.GPIOParameters=PinAttribute
PI4.Mode=RGB888
PI4.PinAttribute=CortexM7
PI4.Signal=LTDC_B4
PI5.GPIOParameters=PinAttribute
PI5.Mode=RGB888
PI5.PinAttribute=CortexM7
PI5.Signal=LTDC_B5
PI6.GPIOParameters=PinAttribute
PI6.Mode=RGB888
PI6.PinAttribute=CortexM7
PI6.Signal=LTDC_B6
PI7.GPIOParameters=PinAttribute
PI7.Mode=RGB888
PI7.PinAttribute=CortexM7
PI7.Signal=LTDC_B7
PI8.GPIOParameters=GPIO_Label,PinAttribute
PI8.GPIO_Label=maxWrite
PI8.Locked=true
PI8.PinAttribute=Free
PI8.Signal=GPIO_Output
PI9.GPIOParameters=PinAttribute
PI9.Mode=RGB888
PI9.PinAttribute=CortexM7
PI9.Signal=LTDC_VSYNC
PJ10.GPIOParameters=PinAttribute
PJ10.Mode=PWM Generation2 CH2 CH2N
PJ10.PinAttribute=CortexM7
PJ10.Signal=TIM1_CH2N
PJ11.GPIOParameters=PinAttribute
PJ11.PinAttribute=CortexM7
PJ11.Signal=S_TIM1_CH2
PJ6.GPIOParameters=PinAttribute
PJ6.PinAttribute=CortexM7
PJ6.Signal=S_TIM8_CH2
PJ7.GPIOParameters=PinAttribute
PJ7.Mode=PWM Generation2 CH2 CH2N
PJ7.PinAttribute=CortexM7
PJ7.Signal=TIM8_CH2N
PJ8.GPIOParameters=PinAttribute
PJ8.PinAttribute=CortexM7
PJ8.Signal=S_TIM8_CH1
PJ9.GPIOParameters=PinAttribute
PJ9.PinAttribute=CortexM7
PJ9.Signal=S_TIM1_CH3
PK0.GPIOParameters=PinAttribute
PK0.PinAttribute=CortexM7
PK0.Signal=S_TIM8_CH3
PK1.GPIOParameters=PinAttribute
PK1.Mode=PWM Generation3 CH3 CH3N
PK1.PinAttribute=CortexM7
PK1.Signal=TIM8_CH3N
PK2.GPIOParameters=PinAttribute
PK2.Mode=RGB888
PK2.PinAttribute=CortexM7
PK2.Signal=LTDC_G7
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.BootMode=boot0
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32H745BITx
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.8.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x200
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=PE_McuConfig.ioc
ProjectManager.ProjectName=PE_McuConfig
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x400
ProjectManager.TargetToolchain=MDK-ARM V5.27
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true-CortexM7,2-SystemClock_Config-RCC-false-HAL-false-CortexM7,3-MX_ADC1_Init-ADC1-false-HAL-true-CortexM7,4-MX_ADC2_Init-ADC2-false-HAL-true-CortexM7,5-MX_ETH_Init-ETH-false-HAL-true-CortexM7,6-MX_FDCAN1_Init-FDCAN1-false-HAL-true-CortexM7,7-MX_HRTIM_Init-HRTIM-false-HAL-true-CortexM7,8-MX_I2C2_Init-I2C2-false-HAL-true-CortexM7,9-MX_LPTIM2_Init-LPTIM2-false-HAL-true-CortexM7,10-MX_LTDC_Init-LTDC-false-HAL-true-CortexM7,11-MX_SPI3_Init-SPI3-false-HAL-true-CortexM7,12-MX_TIM1_Init-TIM1-false-HAL-true-CortexM7,13-MX_TIM4_Init-TIM4-false-HAL-true-CortexM7,14-MX_TIM8_Init-TIM8-false-HAL-true-CortexM7,15-MX_TIM12_Init-TIM12-false-HAL-true-CortexM7,16-MX_TIM16_Init-TIM16-false-HAL-true-CortexM7,17-MX_TIM17_Init-TIM17-false-HAL-true-CortexM7,18-MX_UART5_Init-UART5-false-HAL-true-CortexM7,19-MX_UART7_Init-UART7-false-HAL-true-CortexM7,20-MX_UART8_Init-UART8-false-HAL-true-CortexM7,21-MX_USB_OTG_HS_PCD_Init-USB_OTG_HS-false-HAL-true-CortexM7,22-MX_DFSDM1_Init-DFSDM1-false-HAL-true-CortexM7,23-MX_COMP2_Init-COMP2-false-HAL-true-CortexM7,24-MX_I2C3_SMBUS_Init-I2C3-false-HAL-true-CortexM7,25-MX_SDMMC2_SD_Init-SDMMC2-false-HAL-true-CortexM7,26-MX_TIM5_Init-TIM5-false-HAL-true-CortexM7,27-MX_USART3_UART_Init-USART3-false-HAL-true-CortexM7,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true-CortexM7,0-MX_CORTEX_M4_Init-CORTEX_M4-false-HAL-true-CortexM4
RCC.ADCFreq_Value=150000000
RCC.AHB12Freq_Value=240000000
RCC.AHB4Freq_Value=240000000
RCC.APB1Freq_Value=120000000
RCC.APB2Freq_Value=60000000
RCC.APB3Freq_Value=120000000
RCC.APB4Freq_Value=120000000
RCC.AXIClockFreq_Value=240000000
RCC.CECFreq_Value=32000
RCC.CKPERFreq_Value=64000000
RCC.CPU2Freq_Value=240000000
RCC.CPU2SystikFreq_Value=240000000
RCC.CortexFreq_Value=480000000
RCC.CpuClockFreq_Value=480000000
RCC.D1CPREFreq_Value=480000000
RCC.D1PPRE=RCC_APB3_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
RCC.D2PPRE2=RCC_APB2_DIV4
RCC.D3PPRE=RCC_APB4_DIV2
RCC.DFSDMACLkFreq_Value=480000000
RCC.DFSDMFreq_Value=60000000
RCC.DIVM1=4
RCC.DIVM2=4
RCC.DIVN1=60
RCC.DIVN2=9
RCC.DIVP1Freq_Value=480000000
RCC.DIVP2=1
RCC.DIVP2Freq_Value=150000000
RCC.DIVP3Freq_Value=129000000
RCC.DIVQ1Freq_Value=480000000
RCC.DIVQ2Freq_Value=75000000
RCC.DIVQ3Freq_Value=129000000
RCC.DIVR1Freq_Value=480000000
RCC.DIVR2Freq_Value=75000000
RCC.DIVR3Freq_Value=129000000
RCC.FDCANCLockSelection=RCC_FDCANCLKSOURCE_HSE
RCC.FDCANFreq_Value=24000000
RCC.FMCFreq_Value=240000000
RCC.FamilyName=M
RCC.HCLK3ClockFreq_Value=240000000
RCC.HCLKFreq_Value=240000000
RCC.HPRE=RCC_HCLK_DIV2
RCC.HRTIMFreq_Value=120000000
RCC.HSE_VALUE=24000000
RCC.I2C123Freq_Value=120000000
RCC.I2C4Freq_Value=120000000
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CPU2Freq_Value,CPU2SystikFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVN1,DIVN2,DIVP1Freq_Value,DIVP2,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANCLockSelection,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLL3FRACN,PLLFRACN,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
RCC.LPTIM1Freq_Value=120000000
RCC.LPTIM2Freq_Value=120000000
RCC.LPTIM345Freq_Value=120000000
RCC.LPUART1Freq_Value=120000000
RCC.LTDCFreq_Value=129000000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=480000000
RCC.PLL2FRACN=3072
RCC.PLL3FRACN=0
RCC.PLLFRACN=0
RCC.QSPIFreq_Value=240000000
RCC.RNGFreq_Value=48000000
RCC.RTCFreq_Value=32000
RCC.SAI1Freq_Value=480000000
RCC.SAI23Freq_Value=480000000
RCC.SAI4AFreq_Value=480000000
RCC.SAI4BFreq_Value=480000000
RCC.SDMMCFreq_Value=480000000
RCC.SPDIFRXFreq_Value=480000000
RCC.SPI123Freq_Value=480000000
RCC.SPI45Freq_Value=60000000
RCC.SPI6Freq_Value=120000000
RCC.SWPMI1Freq_Value=120000000
RCC.SYSCLKFreq_VALUE=480000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.Tim1OutputFreq_Value=240000000
RCC.Tim2OutputFreq_Value=120000000
RCC.TraceFreq_Value=480000000
RCC.USART16Freq_Value=60000000
RCC.USART234578Freq_Value=120000000
RCC.USBFreq_Value=480000000
RCC.VCO1OutputFreq_Value=960000000
RCC.VCO2OutputFreq_Value=150000000
RCC.VCO3OutputFreq_Value=258000000
RCC.VCOInput1Freq_Value=16000000
RCC.VCOInput2Freq_Value=16000000
RCC.VCOInput3Freq_Value=2000000
SH.ADCx_INP18.0=ADC2_INP18,IN18-Single-Ended
SH.ADCx_INP18.1=ADC1_INP18,IN18-Single-Ended
SH.ADCx_INP18.ConfNb=2
SH.ADCx_INP3.0=ADC2_INP3,IN3-Single-Ended
SH.ADCx_INP3.1=ADC1_INP3,IN3-Single-Ended
SH.ADCx_INP3.ConfNb=2
SH.S_CKOUTDFSDM1.0=DFSDM1_CKOUT,CKOUT
SH.S_CKOUTDFSDM1.1=DFSDM1_CKOUT,PDM_SPI_Input_from_ch34_and_Internal_Clock
SH.S_CKOUTDFSDM1.2=DFSDM1_CKOUT,PDM_SPI_input_from_ch4_and_internal_clock
SH.S_CKOUTDFSDM1.3=DFSDM1_CKOUT,PDM_SPI_input_from_ch2_and_internal_clock
SH.S_CKOUTDFSDM1.4=DFSDM1_CKOUT,PDM_SPI_Input_from_ch12_and_Internal_Clock
SH.S_CKOUTDFSDM1.ConfNb=5
SH.S_DATAIN2DFSDM1.0=DFSDM1_DATIN2,PDM_SPI_input_from_ch2_and_internal_clock
SH.S_DATAIN2DFSDM1.1=DFSDM1_DATIN2,PDM_SPI_Input_from_ch12_and_Internal_Clock
SH.S_DATAIN2DFSDM1.ConfNb=2
SH.S_DATAIN4DFSDM1.0=DFSDM1_DATIN4,PDM_SPI_Input_from_ch34_and_Internal_Clock
SH.S_DATAIN4DFSDM1.1=DFSDM1_DATIN4,PDM_SPI_input_from_ch4_and_internal_clock
SH.S_DATAIN4DFSDM1.ConfNb=2
SH.S_TIM12_CH1.0=TIM12_CH1,PWM Generation1 CH1
SH.S_TIM12_CH1.ConfNb=1
SH.S_TIM12_CH2.0=TIM12_CH2,PWM Generation2 CH2
SH.S_TIM12_CH2.ConfNb=1
SH.S_TIM16_CH1.0=TIM16_CH1,PWM Generation1 CH1 CH1N
SH.S_TIM16_CH1.ConfNb=1
SH.S_TIM17_CH1.0=TIM17_CH1,PWM Generation1 CH1
SH.S_TIM17_CH1.ConfNb=1
SH.S_TIM1_CH1.0=TIM1_CH1,PWM Generation1 CH1 CH1N
SH.S_TIM1_CH1.ConfNb=1
SH.S_TIM1_CH2.0=TIM1_CH2,PWM Generation2 CH2 CH2N
SH.S_TIM1_CH2.ConfNb=1
SH.S_TIM1_CH3.0=TIM1_CH3,PWM Generation3 CH3 CH3N
SH.S_TIM1_CH3.ConfNb=1
SH.S_TIM4_CH2.0=TIM4_CH2,PWM_Input_2
SH.S_TIM4_CH2.ConfNb=1
SH.S_TIM4_CH3.0=TIM4_CH3,PWM Generation3 CH3
SH.S_TIM4_CH3.ConfNb=1
SH.S_TIM5_CH1.0=TIM5_CH1,PWM_Input_1
SH.S_TIM5_CH1.ConfNb=1
SH.S_TIM8_CH1.0=TIM8_CH1,PWM Generation1 CH1 CH1N
SH.S_TIM8_CH1.ConfNb=1
SH.S_TIM8_CH2.0=TIM8_CH2,PWM Generation2 CH2 CH2N
SH.S_TIM8_CH2.ConfNb=1
SH.S_TIM8_CH3.0=TIM8_CH3,PWM Generation3 CH3 CH3N
SH.S_TIM8_CH3.ConfNb=1
SPI3.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
SPI3.CalculateBaudRate=120.0 MBits/s
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.IPParameters=BaudRatePrescaler,VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI3.Mode=SPI_MODE_MASTER
SPI3.VirtualNSS=VM_NSSHARD
SPI3.VirtualType=VM_MASTER
TIM1.Channel-PWM\ Generation1\ CH1\ CH1N=TIM_CHANNEL_1
TIM1.Channel-PWM\ Generation2\ CH2\ CH2N=TIM_CHANNEL_2
TIM1.Channel-PWM\ Generation3\ CH3\ CH3N=TIM_CHANNEL_3
TIM1.IPParameters=Channel-PWM Generation1 CH1 CH1N,Channel-PWM Generation2 CH2 CH2N,Channel-PWM Generation3 CH3 CH3N
TIM12.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
TIM12.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
TIM12.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2
TIM16.Channel=TIM_CHANNEL_1
TIM16.IPParameters=Channel
TIM17.Channel=TIM_CHANNEL_1
TIM17.IPParameters=Channel
TIM4.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
TIM4.IPParameters=Channel-PWM Generation3 CH3
TIM8.Channel-PWM\ Generation1\ CH1\ CH1N=TIM_CHANNEL_1
TIM8.Channel-PWM\ Generation2\ CH2\ CH2N=TIM_CHANNEL_2
TIM8.Channel-PWM\ Generation3\ CH3\ CH3N=TIM_CHANNEL_3
TIM8.IPParameters=Channel-PWM Generation1 CH1 CH1N,Channel-PWM Generation2 CH2 CH2N,Channel-PWM Generation3 CH3 CH3N
USART3.IPParameters=VirtualMode-Asynchronous
USART3.VirtualMode-Asynchronous=VM_ASYNC
USB_OTG_HS.IPParameters=VirtualMode-Device_HS
USB_OTG_HS.VirtualMode-Device_HS=Device_HS
VP_COMP2_VS_VREFINT.Mode=VREFINT
VP_COMP2_VS_VREFINT.Signal=COMP2_VS_VREFINT
VP_SYS_M4_VS_Systick.Mode=SysTick
VP_SYS_M4_VS_Systick.Signal=SYS_M4_VS_Systick
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
VP_TIM17_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM17_VS_ClockSourceINT.Signal=TIM17_VS_ClockSourceINT
board=custom
